Revit 2016 API
ViewCropRegionShapeManager.SetCropRegionShape Method
 Sets the boundary of the view's crop to the specified shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("Obsolete in Revit 2016, use SetCropShape.")]
public void SetCropRegionShape(
	CurveLoop boundary
)
Visual Basic
<ObsoleteAttribute("Obsolete in Revit 2016, use SetCropShape.")> _
Public Sub SetCropRegionShape ( _
	boundary As CurveLoop _
)
Visual C++
[ObsoleteAttribute(L"Obsolete in Revit 2016, use SetCropShape.")]
public:
void SetCropRegionShape(
	CurveLoop^ boundary
)
Parameters
boundary
Type: Autodesk.Revit.DB.CurveLoop
 The crop boundary.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Boundary in boundary should represent one closed curve loop without self-intersections, consisting of non-zero length straight lines in a plane parallel to the view plane.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The crop of the associated view is not permitted to have a non-rectangular shape.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace